Documents/А_АрендаТехники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>А_АрендаТехники</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеЗаказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_Необновлять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Моточасы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТопливоОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТопливоЗаправлено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТопливоВДороге</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтработаноНаОбъекте</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтработаноНаОбъектеНаДругогоПодрядчика</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтработаноНаОбъектеРемонт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Простой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеЗаказчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.А_ВидыУчетаРаботыТехники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтороннийЗаказчик</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентЗаказчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеРасхода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ФормыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ФормыОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Взаимозачет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БонусныеБаллы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/А_АрендаТехники/Ext/ObjectModule.bsl
Процедура СоздатьДокументОказанияУслугМеждуПодразделениямиПоАрендеТехники() Экспорт

	// Статья затрат "Оренда техніки" (код 00-000024)
	// СДД продавец/покупатель — "Оренда технiки" (код УТ-001130)
	// Номенклатура — "Фінансова послуга для звіту P&L" (код 0Ц-00000002)
	// Форма оплаты — Безналичная

	// === 1. Знайти ВСІ існуючі підлеглі — відмінити проведення + помітка на видалення ===
	ЗапросСуществующий = Новый Запрос;
	ЗапросСуществующий.УстановитьПараметр("АрендаТехники", Ссылка);
	ЗапросСуществующий.Текст = "ВЫБРАТЬ
		|	А_ОказаниеУслугМеждуПодразделениями.Ссылка КАК Ссылка,
		|	А_ОказаниеУслугМеждуПодразделениями.Проведен КАК Проведен
		|ИЗ
		|	Документ.А_ОказаниеУслугМеждуПодразделениями КАК А_ОказаниеУслугМеждуПодразделениями
		|ГДЕ
		|	А_ОказаниеУслугМеждуПодразделениями.АрендаТехники = &АрендаТехники";

	Выборка = ЗапросСуществующий.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если Выборка.Проведен Тогда
			ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
		ДокОбъект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;

	// === 2. Якщо Аренда НЕ проведена — підлеглі вже помічені, виходимо ===
	Если НЕ Проведен Тогда
		Возврат;
	КонецЕсли;

	// === 3. Знайти помічений на видалення (переиспользовать) або створити новий ===
	Результат = ЗапросСуществующий.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		ВыборкаДок = Результат.Выбрать();
		ВыборкаДок.Следующий();
		ДокОказание = ВыборкаДок.Ссылка.ПолучитьОбъект();
		ДокОказание.УстановитьПометкуУдаления(Ложь);
		ДокОказание.Услуги.Очистить();
	Иначе
		ДокОказание = Документы.А_ОказаниеУслугМеждуПодразделениями.СоздатьДокумент();
	КонецЕсли;

	// === 4. Заповнення шапки ===
	ДокОказание.Дата = Дата;
	ДокОказание.Организация = Организация;
	ДокОказание.АрендаТехники = Ссылка;
	ДокОказание.А_Обработан = Истина;
	ДокОказание.А_ВведенВЕРП = Истина;
	ДокОказание.Комментарий = "Оренда технiки " + Формат(Дата, "ДФ=ММММ yyyy");

	// === 5. Довідкові дані ===
	СтатьяЗатрат = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("00-000024");
	СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("УТ-001130");
	НоменклатураУслуга = Справочники.Номенклатура.НайтиПоКоду("0Ц-00000002");
	ФормаОплатыБезнал = Перечисления.ФормыОплаты.Безналичная;

	// === 6. Заповнення ТЧ Услуги ===
	КодСтроки = 0;
	СуммаДокумента = 0;

	Для каждого СтрокаСостав Из Состав Цикл

		Если СтрокаСостав.СтороннийЗаказчик ИЛИ СтрокаСостав.Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;

		КодСтроки = КодСтроки + 1;
		НоваяСтрока = ДокОказание.Услуги.Добавить();
		НоваяСтрока.КодСтроки = КодСтроки;
		НоваяСтрока.ПодразделениеПродавец = А_Привилегированный.А_ПолучитьПодразделениеПоНаправлениюИПодразделениюКазны(СтрокаСостав.НаправлениеДохода, СтрокаСостав.Подразделение);
		НоваяСтрока.ПодразделениеПокупатель = А_Привилегированный.А_ПолучитьПодразделениеПоНаправлениюИПодразделениюКазны(СтрокаСостав.НаправлениеРасхода, СтрокаСостав.ПодразделениеЗаказчик);
		НоваяСтрока.Сумма = СтрокаСостав.Сумма;
		НоваяСтрока.Номенклатура = НоменклатураУслуга;
		НоваяСтрока.СтатьяЗатрат = СтатьяЗатрат;
		НоваяСтрока.СтатьяДвиженияДенежныхСредствПродавец = СтатьяДДС;
		НоваяСтрока.СтатьяДвиженияДенежныхСредствПокупатель = СтатьяДДС;
		НоваяСтрока.ФормаОплаты = ФормаОплатыБезнал;
		НоваяСтрока.Комментарий = СокрЛП(СтрокаСостав.Номенклатура) + " " + СокрЛП(СтрокаСостав.ФИО);
		СуммаДокумента = СуммаДокумента + СтрокаСостав.Сумма;

	КонецЦикла;

	ДокОказание.СуммаДокумента = СуммаДокумента;

	// === 7. Запис, проведення, створення реалізацій ===
	Если КодСтроки > 0 Тогда
		ДокОказание.Записать(РежимЗаписиДокумента.Проведение);
		ДокОказание.СоздатьРеализацииПоОказанииУслугНаСервере();
		Сообщить("Створено/оновлено оказание послуг: " + ДокОказание.Ссылка + " сума: " + Формат(СуммаДокумента, "ЧЦ=15; ЧДЦ=2"));
	КонецЕсли;

КонецПроцедуры

Процедура А_АрендаТехникиПослеОбмена() Экспорт

	Если А_Обработан Тогда
		Возврат;
	КонецЕсли;

	Если А_Необновлять Тогда
		А_Обработан = Истина;
		Возврат;
	КонецЕсли;

	А_Обработан = Истина;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	А_АрендаТехникиПослеОбмена();

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СоздатьДокументОказанияУслугМеждуПодразделениямиПоАрендеТехники();

КонецПроцедуры
